dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxQspi_bf.h
/** \brief Length for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_LEN (16u)

/** \brief Mask for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_MSK (0xffffu)

/** \brief Offset for Ifx_QSPI_XXLCON_Bits.XDL */
#define IFX_QSPI_XXLCON_XDL_OFF (0u)

/** \brief Length for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_LEN (16u)

/** \brief Mask for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_QSPI_XXLCON_Bits.BYTECOUNT */
#define IFX_QSPI_XXLCON_BYTECOUNT_OFF (16u)

/** \brief Length for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_MIXENTRY_Bits.E */
#define IFX_QSPI_MIXENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_BACONENTRY_Bits.E */
#define IFX_QSPI_BACONENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_DATAENTRY_Bits.E */
#define IFX_QSPI_DATAENTRY_E_OFF (0u)

/** \brief Length for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_RXEXIT_Bits.E */
#define IFX_QSPI_RXEXIT_E_OFF (0u)

/** \brief Length for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_LEN (32u)

/** \brief Mask for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_MSK (0xffffffffu)

/** \brief Offset for Ifx_QSPI_RXEXITD_Bits.E */
#define IFX_QSPI_RXEXITD_E_OFF (0u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.CAP */
#define IFX_QSPI_CAPCON_CAP_LEN (15u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.CAP */
#define IFX_QSPI_CAPCON_CAP_MSK (0x7fffu)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.CAP */
#define IFX_QSPI_CAPCON_CAP_OFF (0u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.OVF */
#define IFX_QSPI_CAPCON_OVF_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.OVF */
#define IFX_QSPI_CAPCON_OVF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.OVF */
#define IFX_QSPI_CAPCON_OVF_OFF (15u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.EDGECON */
#define IFX_QSPI_CAPCON_EDGECON_LEN (2u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.EDGECON */
#define IFX_QSPI_CAPCON_EDGECON_MSK (0x3u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.EDGECON */
#define IFX_QSPI_CAPCON_EDGECON_OFF (16u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.INS */
#define IFX_QSPI_CAPCON_INS_LEN (2u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.INS */
#define IFX_QSPI_CAPCON_INS_MSK (0x3u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.INS */
#define IFX_QSPI_CAPCON_INS_OFF (18u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.EN */
#define IFX_QSPI_CAPCON_EN_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.EN */
#define IFX_QSPI_CAPCON_EN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.EN */
#define IFX_QSPI_CAPCON_EN_OFF (20u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.CAPC */
#define IFX_QSPI_CAPCON_CAPC_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.CAPC */
#define IFX_QSPI_CAPCON_CAPC_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.CAPC */
#define IFX_QSPI_CAPCON_CAPC_OFF (28u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.CAPS */
#define IFX_QSPI_CAPCON_CAPS_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.CAPS */
#define IFX_QSPI_CAPCON_CAPS_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.CAPS */
#define IFX_QSPI_CAPCON_CAPS_OFF (29u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.CAPF */
#define IFX_QSPI_CAPCON_CAPF_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.CAPF */
#define IFX_QSPI_CAPCON_CAPF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.CAPF */
#define IFX_QSPI_CAPCON_CAPF_OFF (30u)

/** \brief Length for Ifx_QSPI_CAPCON_Bits.CAPSEL */
#define IFX_QSPI_CAPCON_CAPSEL_LEN (1u)

/** \brief Mask for Ifx_QSPI_CAPCON_Bits.CAPSEL */
#define IFX_QSPI_CAPCON_CAPSEL_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_CAPCON_Bits.CAPSEL */
#define IFX_QSPI_CAPCON_CAPSEL_OFF (31u)

/** \brief Length for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_LEN (13u)

/** \brief Mask for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_MSK (0x1fffu)

/** \brief Offset for Ifx_QSPI_MC_Bits.MCOUNT */
#define IFX_QSPI_MC_MCOUNT_OFF (0u)

/** \brief Length for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_LEN (13u)

/** \brief Mask for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_MSK (0x1fffu)

/** \brief Offset for Ifx_QSPI_MC_Bits.CURRENT */
#define IFX_QSPI_MC_CURRENT_OFF (16u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_LEN (3u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_MSK (0x7u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.TPRE2 */
#define IFX_QSPI_MCCON_TPRE2_OFF (0u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_LEN (3u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_MSK (0x7u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.TRAIL2 */
#define IFX_QSPI_MCCON_TRAIL2_OFF (3u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLEN */
#define IFX_QSPI_MCCON_IBLEN_OFF (16u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLF */
#define IFX_QSPI_MCCON_IBLF_OFF (17u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLC */
#define IFX_QSPI_MCCON_IBLC_OFF (18u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_LEN (1u)

